In [2]:
%load_ext sql
%sql postgresql://emilianodesu:password123@localhost:5432/ejercicio5

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS cliente (
    id_cliente SERIAL PRIMARY KEY,
    nom_cliente VARCHAR(50) NOT NULL
);

CREATE TABLE IF NOT EXISTS articulo (
    num_articulo SERIAL PRIMARY KEY,
    nom_articulo VARCHAR(50) NOT NULL,
    precio NUMERIC(10,2),
    CONSTRAINT verifica_precio CHECK (precio > 0)
);

CREATE TABLE IF NOT EXISTS orden (
    id_orden SERIAL PRIMARY KEY,
    fecha DATE NOT NULL DEFAULT now(),
    estado VARCHAR(50),
    id_cliente INT NOT NULL,
    CONSTRAINT fk_cliente FOREIGN KEY (id_cliente) REFERENCES cliente(id_cliente) ON DELETE RESTRICT ON UPDATE CASCADE
);

CREATE TABLE IF NOT EXISTS orden_articulos (
    id_orden INT NOT NULL,
    num_articulo INT NOT NULL,
    cantidad INT NOT NULL,
    CONSTRAINT pk_orden_articulos PRIMARY KEY (id_orden, num_articulo),
    CONSTRAINT fk_orden FOREIGN KEY (id_orden) REFERENCES orden(id_orden) ON DELETE CASCADE,
    CONSTRAINT fk_articulo FOREIGN KEY (num_articulo) REFERENCES articulo(num_articulo) ON DELETE RESTRICT ON UPDATE CASCADE
);

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
Done.
Done.
Done.
Done.

[]

In [4]:
%%sql
ALTER TABLE orden ALTER COLUMN fecha SET DEFAULT now();

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
Done.

[]

In [5]:
%%sql
INSERT INTO cliente (nom_cliente) VALUES 
('Juan Pérez'), 
('Ana López'), 
('Carlos Gómez');

INSERT INTO articulo (nom_articulo, precio) VALUES 
('Laptop', 15000.00), 
('Smartphone', 8000.00), 
('Tablet', 5000.00);

INSERT INTO orden (estado, id_cliente) VALUES 
('Procesado', 1), 
('Enviado', 2), 
('Cancelado', 3);

INSERT INTO orden_articulos (id_orden, num_articulo, cantidad) VALUES 
(1, 1, 2), 
(2, 2, 1),
(3, 3, 5);

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
3 rows affected.
3 rows affected.
3 rows affected.
3 rows affected.

[]

In [6]:
%%sql
SELECT * FROM cliente;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
3 rows affected.

[(1, 'Juan Pérez'), (2, 'Ana López'), (3, 'Carlos Gómez')]

In [7]:
%%sql
SELECT * FROM articulo;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
3 rows affected.

[(1, 'Laptop', Decimal('15000.00')),
 (2, 'Smartphone', Decimal('8000.00')),
 (3, 'Tablet', Decimal('5000.00'))]

In [8]:
%%sql
SELECT * FROM orden;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
3 rows affected.

[(1, datetime.date(2024, 9, 17), 'Procesado', 1),
 (2, datetime.date(2024, 9, 17), 'Enviado', 2),
 (3, datetime.date(2024, 9, 17), 'Cancelado', 3)]

In [10]:
%%sql
SELECT orden.id_orden, orden.fecha, cliente.id_cliente,cliente.nom_cliente, orden.estado, articulo.num_articulo, articulo.nom_articulo, orden_articulos.cantidad, articulo.precio
FROM orden
JOIN cliente ON orden.id_cliente = cliente.id_cliente
JOIN orden_articulos ON orden.id_orden = orden_articulos.id_orden
JOIN articulo ON orden_articulos.num_articulo = articulo.num_articulo;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio5
3 rows affected.

[(1, datetime.date(2024, 9, 17), 1, 'Juan Pérez', 'Procesado', 1, 'Laptop', 2, Decimal('15000.00')),
 (2, datetime.date(2024, 9, 17), 2, 'Ana López', 'Enviado', 2, 'Smartphone', 1, Decimal('8000.00')),
 (3, datetime.date(2024, 9, 17), 3, 'Carlos Gómez', 'Cancelado', 3, 'Tablet', 5, Decimal('5000.00'))]